if OS.mac?
    # taps
    tap "homebrew/cask"
    tap "homebrew/cask-fonts"

    brew "mas"
    brew "trash"
    brew "blueutil"
    brew "gnu-tar"

    # Applications
    cask "mactex"
    cask "skim"
    cask "iina"
    cask "font-hack-nerd-font"
    cask "adoptopenjdk"
    cask "virtualbox"
    cask "spotify"
    cask "skype"
    cask "alfred"
    cask "djview"
    cask "kindle"
    cask "whatsapp"
    cask "notion"
    cask "zotero"
    cask "obsidian"
    cask "xquartz"
    cask "miniconda"
    cask "balenaetcher"

    # Browsers
    cask "firefox"
    cask "google-chrome"

    # Cloud
    cask "nomachine"
    cask "cyberduck"
    cask "osxfuse"
    cask "dropbox"
    cask "google-backup-and-sync"
    cask "mattermost"

    # Terminals
    cask "alacritty"
    cask "iterm2"
    cask "kitty"
    cask "go2shell"

    # macOS App Store
    mas "1Password 7", id:1333542190
    mas "Typeeto", id: 970502923
    mas "Notability", id:736189492
    mas "Xcode", id:497799835
    mas "Spark", id:1176895641
    mas "Theine", id:955848755
    mas "Dropover", id:1355679052
    mas "Moom", id:419330170
    mas "Adblock Plus", id:1432731683
elsif OS.linux?
    brew "xclip"
end

tap "homebrew/bundle"
tap "homebrew/core"

# packages
brew "asciidoc"
brew "exa"
brew "cmake"
brew "ctags"
brew "direnv"
brew "docker"
brew "docker-machine"
brew "docker-compose"
brew "fd"
brew "fzf"
brew "gimp"
brew "git"
brew "gnupg"
brew "highlight"
brew "htop"
brew "hub"
brew "imagemagick"
brew "lazygit"
brew "neovim"
brew "node"
brew "p7zip"
brew "pdf2svg"
brew "pipenv"
brew "python"
brew "python3"
brew "rbenv"
brew "rsync"
brew "ripgrep"
brew "syncthing"
brew "tldr"
brew "tmux"
brew "wget"
brew "yarn"
brew "zsh"
